---
kind: method
id: M:Autodesk.Revit.DB.DefinitionGroups.GetBasicIEnumerator
source: html/024c295f-54a1-d4ec-130c-75da6922a7da.htm
---
# Autodesk.Revit.DB.DefinitionGroups.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.